//-----------------------------------------------------------------------------
// @brief  メイン処理.
// 2022.6.25 saito_suzuna
//-----------------------------------------------------------------------------

// プリコンパイル済みヘッダーのインクルード
#include "pch.h"

//-----------------------------------------------------------------------------
// @brief  メイン関数.
//-----------------------------------------------------------------------------
int WINAPI WinMain(HINSTANCE, HINSTANCE, LPSTR, int)
{
	// ゲームクラスの定義
	Game game;
	// ゲームクラスの初期化が成功したか
	bool success = game.Initialize();

	// 最初のシーンを設定
	game.SetFirstScene(new Title());

	if (success)
	{
		game.GameLoop();
	}

	// ゲームクラスの終了処理
	game.Termination();

	// ソフトの終了
	return 0;
}